# UNINA-YOLO-DLA Model Configuration (Ultralytics-Compatible)
# Optimized for NVIDIA Jetson Orin DLA (Deep Learning Accelerator)
# 
# Key Constraints:
#   - ReLU only (no SiLU) - set via activation below
#   - P2, P3, P4 heads (includes small object detection)
#   - Static shapes (640x640)
#   - All DLA-compatible operations

# Number of classes (Formula Student Cones)
nc: 4

# Scaling factors
depth_multiple: 0.50
width_multiple: 0.25

# NOTE: Activation is set to ReLU at runtime via train.py replace_silu_with_relu()
# This is required for DLA compatibility (SiLU not supported on DLA)

# Backbone
# [from, repeats, module, args]
backbone:
  # Stem
  - [-1, 1, Conv, [64, 3, 2]]           # 0: P1/2 (320x320)
  - [-1, 1, Conv, [128, 3, 2]]          # 1: P2/4 (160x160)
  - [-1, 3, C3k2, [128, False, 0.25]]   # 2: 
  - [-1, 1, Conv, [256, 3, 2]]          # 3: P3/8 (80x80)
  - [-1, 6, C3k2, [256, False, 0.25]]   # 4:
  - [-1, 1, Conv, [512, 3, 2]]          # 5: P4/16 (40x40)
  - [-1, 6, C3k2, [512, False, 0.25]]   # 6:
  - [-1, 1, Conv, [1024, 3, 2]]         # 7: P5/32 (20x20)
  - [-1, 3, C3k2, [1024, True, 0.5]]    # 8:
  - [-1, 1, SPPF, [1024, 5]]            # 9: SPPF (Standard is DLA-safe in v8+, auto-scaled)

# Head (FPN + PAN with P2 support)
# Optimized for small object detection (cones at distance)
head:
  # Top-Down (FPN) - Standard path
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10: 40x40
  - [[-1, 6], 1, Concat, [1]]                    # 11: concat P4
  - [-1, 3, C3k2, [512, False, 0.25]]            # 12: FPN P4

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 13: 80x80
  - [[-1, 4], 1, Concat, [1]]                    # 14: concat P3
  - [-1, 3, C3k2, [256, False, 0.25]]            # 15: FPN P3

  # P2 branch for small objects (critical for distant cones)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16: 160x160
  - [[-1, 2], 1, Concat, [1]]                    # 17: concat P2
  - [-1, 3, C3k2, [128, False, 0.25]]            # 18: FPN P2

  # Bottom-Up (PAN)
  - [-1, 1, Conv, [128, 3, 2]]                   # 19: 80x80
  - [[-1, 15], 1, Concat, [1]]                   # 20: concat with FPN P3
  - [-1, 3, C3k2, [256, False, 0.25]]            # 21: PAN P3

  - [-1, 1, Conv, [256, 3, 2]]                   # 22: 40x40
  - [[-1, 12], 1, Concat, [1]]                   # 23: concat with FPN P4
  - [-1, 3, C3k2, [512, False, 0.25]]            # 24: PAN P4

  # Detection heads (P2, P3, P4)
  # Includes P2 for small object detection - CRITICAL for DLA deployment
  - [[18, 21, 24], 1, Detect, [nc]]              # 25: Detect(P2, P3, P4)
