# UNINA-YOLO-DLA Model Configuration (Ultralytics-Compatible)
# Optimized for NVIDIA Jetson Orin DLA (Deep Learning Accelerator)
# 
# Key Constraints:
#   - ReLU only (no SiLU) - set via activation below
#   - P2, P3, P4 heads (includes small object detection)
#   - Static shapes (640x640)
#   - All DLA-compatible operations
#
# MODIFIED: Explicit channel scaling applied (width_multiple=1.0) to resolve DLA/custom layer parsing issues.
# Original width_multiple was 0.25. All channels divided by 4.

# Number of classes (Formula Student Cones)
nc: 4

# Scaling factors
depth_multiple: 0.50
width_multiple: 1.00  # Channels are now explicitly scaled in config
scale: m             # Fixes UnboundLocalError: scale in Ultralytics parser
scales:              # Added scales (plural) block for YOLOv11 compatibility
  m: [0.5, 1.0, 1024] # [depth, width, max_channels]

# NOTE: Activation is set to ReLU at runtime via train.py replace_silu_with_relu()
# This is required for DLA compatibility (SiLU not supported on DLA)

# Backbone
# [from, repeats, module, args]
backbone:
  # Stem
  - [-1, 1, Conv, [16, 3, 2]]           # 0: P1/2 (320x320)  (64 -> 16)
  - [-1, 1, Conv, [32, 3, 2]]          # 1: P2/4 (160x160)  (128 -> 32)
  - [-1, 3, C3k2, [32, False, 0.25]]   # 2:                 (128 -> 32)
  - [-1, 1, Conv, [64, 3, 2]]          # 3: P3/8 (80x80)    (256 -> 64)
  - [-1, 6, C3k2, [64, False, 0.25]]   # 4:                 (256 -> 64)
  - [-1, 1, Conv, [128, 3, 2]]          # 5: P4/16 (40x40)   (512 -> 128)
  - [-1, 6, C3k2, [128, False, 0.25]]   # 6:                 (512 -> 128)
  - [-1, 1, SPPF_DLA, [128, 5]]         # 7: SPPF_DLA        (512 -> 128)

# Head (FPN + PAN with P2 support)
# Optimized for small object detection (cones at distance)
head:
  # Top-Down (FPN)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 8: 80x80 (from 7)
  - [[-1, 4], 1, Concat, [1]]                    # 9: concat P3 (from 4)
  - [-1, 3, C3k2, [64, False, 0.25]]            # 10: FPN P3 (256 -> 64)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 11: 160x160 (from 10)
  - [[-1, 2], 1, Concat, [1]]                    # 12: concat P2 (from 2)
  - [-1, 3, C3k2, [32, False, 0.25]]            # 13: FPN P2 (128 -> 32)

  # Bottom-Up (PAN)
  - [-1, 1, Conv, [32, 3, 2]]                   # 14: 80x80 (from 13) (128 -> 32)
  - [[-1, 10], 1, Concat, [1]]                   # 15: concat with FPN P3 (from 10)
  - [-1, 3, C3k2, [64, False, 0.25]]            # 16: PAN P3 (256 -> 64)

  - [-1, 1, Conv, [64, 3, 2]]                   # 17: 40x40 (from 16) (256 -> 64)
  - [[-1, 7], 1, Concat, [1]]                    # 18: concat with SPPF_DLA (from 7)
  - [-1, 3, C3k2, [128, False, 0.25]]            # 19: PAN P4 (512 -> 128)

  # Detection heads (P2, P3, P4)
  # Includes P2 for small object detection - CRITICAL for DLA deployment
  - [[13, 16, 19], 1, Detect, [nc]]              # 20: Detect(P2, P3, P4)
